server/artillery/result/NGINX_or_Direct/사용자검색50초200명Direct/api_test.yaml
config:
  target : 'http://49.50.167.202:3001'
  phases:
#    - duration: 60
#      arrivalRate: 5
#      name: Warm up
#    - duration: 120
#      arrivalRate: 5
#      rampTo: 50
#      name: Ramp up load
    - duration: 50
      arrivalRate: 200
      name: Sustained load

#before:
#  flow:
#    - post:
#        url : '/api/user/auth/signin'
#        json:
#          id: 'kny@gmail.com'
#          password: '12341234'
#        capture:
#          json: '$.result.accessToken'
#          as: accessToken
#        expect:
#          - statusCode: 201
scenarios:
  - flow:
      - get:
          url: '/api/users?search=t'
#        headers:
#          authorization: 'Bearer {{accessToken}}'
#      - get:
#          url: '/api/user/followings'
#          headers:
#            authorization: 'Bearer {{accessToken}}'
#      - think : 1
#      - get:
#          url: '/api/communities'
#          headers:
#            authorization: 'Bearer {{accessToken}}'
#      - think : 1
#      - get:
#          url: '/api/communities/6390862b2258e789af7d7366/users'
#          headers:
#            authorization: 'Bearer {{accessToken}}'